Обработки/Reports/_ОтчетОДоходахИРасходахБлагосостояние.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОДоходахИРасходахБлагосостояние</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючТекущегоВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОДоходахИРасходахБлагосостояние/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет о доходах и расходах (Благосостояние)",
		"1.30",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.Подписант			= НастройкиОтчета.Подписант.КонтактноеЛицо;
	ЭтотОбъект.КлючТекущегоВарианта	= НастройкиОтчета.КлючТекущегоВарианта;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.КлючТекущегоВарианта) Тогда 
		ЭтотОбъект.КлючТекущегоВарианта = "Благосостояние2019";
	КонецЕсли;
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	Сформировать(ДокументРезультат, Новый ТабличныйДокумент);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	//Настройки.Добавить("ВариантОтчета");
	Настройки.Добавить("КлючТекущегоВарианта");	
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Возврат Настройки;

КонецФункции

Процедура Сформировать(ДокументРезультат, ДокументРасшифровка)	Экспорт
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления,Подписант,КлючТекущегоВарианта");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();
    Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ДокументРезультат.Очистить();
	ДокументРасшифровка.Очистить();
	
	ТипЧисло = Новый ОписаниеТипов("Число"); 
	
	ОбластиИЗначения = Новый Структура;
	
	//таблицы с расшифровками прочих доходов и Расходов
	ПрочиеДоходы = Новый ТаблицаЗначений;
	ПрочиеДоходы.Колонки.Добавить("ПрочиеДоходыРасходы");
	ПрочиеДоходы.Колонки.Добавить("Сумма", ТипЧисло);
	
	ПрочиеРасходы = Новый ТаблицаЗначений;
	ПрочиеРасходы.Колонки.Добавить("ПрочиеДоходыРасходы");
	ПрочиеРасходы.Колонки.Добавить("Сумма", ТипЧисло);	
	
	ПрочиеДоходыЕПС = Новый ТаблицаЗначений;
	ПрочиеДоходыЕПС.Колонки.Добавить("ПрочиеДоходыРасходы");
	ПрочиеДоходыЕПС.Колонки.Добавить("Сумма", ТипЧисло);
	
	ПрочиеРасходыЕПС = Новый ТаблицаЗначений;
	ПрочиеРасходыЕПС.Колонки.Добавить("ПрочиеДоходыРасходы");
	ПрочиеРасходыЕПС.Колонки.Добавить("Сумма", ТипЧисло);	
	
	//колонки как запросе к 91-му. кроме Фильтра и Строки Отчета
	ТабРасшифровки = Новый ТаблицаЗначений;
	ТабРасшифровки.Колонки.Добавить("СтрокаОтчета");
	ТабРасшифровки.Колонки.Добавить("Счет");
	ТабРасшифровки.Колонки.Добавить("КорСчет");
	ТабРасшифровки.Колонки.Добавить("ПрочиеДоходыРасходы");
	ТабРасшифровки.Колонки.Добавить("ЦенныеБумаги");
	ТабРасшифровки.Колонки.Добавить("ЦенныеБумагиНаименование");
	ТабРасшифровки.Колонки.Добавить("ОбращаетсяНаОРЦБ");
	ТабРасшифровки.Колонки.Добавить("Фильтр");
	ТабРасшифровки.Колонки.Добавить("СуммаОборотКт");
	ТабРасшифровки.Колонки.Добавить("СуммаОборотДт");
	ТабРасшифровки.Колонки.Добавить("Регистратор");
	
	ТабРасшифровкиЕПС = Новый ТаблицаЗначений;
	ТабРасшифровкиЕПС.Колонки.Добавить("СтрокаОтчета");
	ТабРасшифровкиЕПС.Колонки.Добавить("СчетРодитель");
	ТабРасшифровкиЕПС.Колонки.Добавить("Счет");
	ТабРасшифровкиЕПС.Колонки.Добавить("ГФУ");
	ТабРасшифровкиЕПС.Колонки.Добавить("ЦенныеБумаги");
	ТабРасшифровкиЕПС.Колонки.Добавить("Фильтр");
	ТабРасшифровкиЕПС.Колонки.Добавить("СуммаОборотКт");
	ТабРасшифровкиЕПС.Колонки.Добавить("СуммаОборотДт");
	ТабРасшифровкиЕПС.Колонки.Добавить("КорСчет");
	ТабРасшифровкиЕПС.Колонки.Добавить("Регистратор");
	
	ДатаНачальная = Период.ДатаНачала;
	ДатаКонечная = Период.ДатаОкончания;	
		
	ОбщиеФункции = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ОтчетыДоходыРасходыОбщиеФункции");
		
	НастройкиУчетаАктивов = ОбщиеФункции.ПолучитьНастройкиУчетаАктивов(Организация, СчетДоверительногоУправления, ДатаКонечная, Перечисления.ВидыУчета.НалоговыйУчет);
	НастройкиУчетаКомиссии = ОбщиеФункции.ПолучитьНастройкиУчетаКомиссии(Организация, СчетДоверительногоУправления, ДатаКонечная, Перечисления.ВидыУчета.НалоговыйУчет);
		
	//НУ
	Если ЭтотОбъект.КлючТекущегоВарианта = "Благосостояние" Тогда 
		ЯчейкаПрочиеДоходы = "19_10";
		ЯчейкаПрочиеРасходы = "28_6";
	ИначеЕсли ЭтотОбъект.КлючТекущегоВарианта = "Благосостояние2019" Тогда
		ЯчейкаПрочиеДоходы = "19_8";
		ЯчейкаПрочиеРасходы = "25_6";		
	ИначеЕсли ЭтотОбъект.КлючТекущегоВарианта = "Благосостояние2020" Тогда	
		ЯчейкаПрочиеДоходы = "18_8";
		ЯчейкаПрочиеРасходы = "24_6";				
	ИначеЕсли ЭтотОбъект.КлючТекущегоВарианта = "Благосостояние2021" Тогда	
		ЯчейкаПрочиеДоходы = "18_8";
		ЯчейкаПрочиеРасходы = "24_6";						
	КонецЕсли;	
	
	МакетНастройка = ПолучитьМакет("Настройка" + ЭтотОбъект.КлючТекущегоВарианта);
	ТаблицаНастройки = ОбщиеФункции.ПолучитьТаблицуНастроекИзМакета(МакетНастройка, "ЗаголовкиНУ", "ДанныеНУ", "Колонки", НастройкиУчетаАктивов, НастройкиУчетаКомиссии);	
		
	ТаблицаРезультат = ОбщиеФункции.ЗапросДоходыРасходы(Организация, СчетДоверительногоУправления, ДатаКонечная, "НалоговыйУчет", ДатаНачальная);	
	ОбщиеФункции.РаспределениеРезультата(ТаблицаРезультат, ТаблицаНастройки, "Н" + ЯчейкаПрочиеДоходы, "Н" + ЯчейкаПрочиеРасходы, ОбластиИЗначения, ТабРасшифровки, ПрочиеДоходы, ПрочиеРасходы);
	
	Если ЭтотОбъект.КлючТекущегоВарианта = "Благосостояние" ИЛИ ЭтотОбъект.КлючТекущегоВарианта = "Благосостояние2019" Тогда 
	
		//ЕПС
		ТаблицаНастройки = ОбщиеФункции.ТабличныйДокументВТаблицуЗначений(МакетНастройка, "ЗаголовкиЕПС", "ДанныеЕПС", "Колонки");	
		ОбщиеФункции.ОбработатьТаблицуНастроек(ТаблицаНастройки, , , "ЕПС");	
	
		
		ТаблицаРезультат = ОбщиеФункции.ЗапросДоходыРасходыЕПС(Организация, СчетДоверительногоУправления, ДатаНачальная, ДатаКонечная);	
		ОбщиеФункции.РаспределениеРезультатаЕСП(ТаблицаРезультат, ТаблицаНастройки, "Б" + ЯчейкаПрочиеДоходы, "Б" + ЯчейкаПрочиеРасходы, ОбластиИЗначения, ТабРасшифровкиЕПС, ПрочиеДоходыЕПС, ПрочиеРасходыЕПС);
	
		//Разница между ЕПС-НУ
		ТаблицаНастройки = ОбщиеФункции.ТабличныйДокументВТаблицуЗначений(МакетНастройка, "ЗаголовкиИтог", "ДанныеИтог", "Колонки");
		ОбщиеФункции.ОбработатьТаблицуНастроек(ТаблицаНастройки, , , "Сравнение");
			
	КонецЕсли;	
	
	ОбщиеФункции.РасчетИтогов(ТаблицаНастройки, ОбластиИЗначения);	
	
	//вывод формы	
	Отчет = ПолучитьМакет("Отчет"+ЭтотОбъект.КлючТекущегоВарианта);
	ОбластьОтчет = Отчет.ПолучитьОбласть("Отчет");
		
	//шапка 
	ПараметрыШапки = РаботаСОтчетами.ПолучитьПараметрыШапки(ДатаКонечная, Организация, СчетДоверительногоУправления);
	
	ОбластьОтчет.Параметры.Заполнить(ПараметрыШапки);
	ОбластьОтчет.Параметры.ПериодОтчета = ПредставлениеПериода(ДатаНачальная, ДатаКонечная, "ФП=Истина");
	
	//показатели
	ОбщиеФункции.ЗаполнениеОбластиЗначениями(ОбластьОтчет, ОбластиИЗначения); 	
	ДокументРезультат.Вывести(ОбластьОтчет);
	
	// Подписи	
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Подразделение", ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
	СтруктураКлюча.Вставить("Язык", ПредопределенноеЗначение("Справочник.Языки.Русский"));
	СтруктураКлюча.Вставить("Объект", ЭтотОбъект.Организация);
	СтруктураКлюча.Вставить("КонтактноеЛицо", ЭтотОбъект.Подписант);
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча);
	
	ПараметрыВыводаПодписей = Новый Структура;
	ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);	
	КонецЕсли; 
	
	РаботаСОтчетами.ВывестиПодписи(ДокументРезультат, ПараметрыВыводаПодписей);
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, "ОтчетОДоходахИРасходах."+ ЭтотОбъект.КлючТекущегоВарианта, , ОриентацияСтраницы.Портрет);		
	
	//Расшифровка
	ОбщиеФункции.ПечатьРасшифровки(ПолучитьМакет("Расшифровка"), ДокументРасшифровка, ТабРасшифровки);
	Если ЭтотОбъект.КлючТекущегоВарианта = "Благосостояние" ИЛИ ЭтотОбъект.КлючТекущегоВарианта = "Благосостояние2019" Тогда
		ОбщиеФункции.ПечатьРасшифровки(ПолучитьМакет("РасшифровкаЕПС"), ДокументРасшифровка, ТабРасшифровкиЕПС);
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	
	
КонецПроцедуры	


Процедура ПроверкаНастроек(ДокументРезультат)	Экспорт
	
	ОбщиеФункции = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ОтчетыДоходыРасходыОбщиеФункции");
	
	МакетНастройка = ПолучитьМакет("Настройка" + ЭтотОбъект.КлючТекущегоВарианта);	
	НастройкиУчетаАктивов = ОбщиеФункции.ПолучитьНастройкиУчетаАктивов(Организация, СчетДоверительногоУправления, Период.ДатаОкончания, Перечисления.ВидыУчета.НалоговыйУчет);
	НастройкиУчетаКомиссии = ОбщиеФункции.ПолучитьНастройкиУчетаКомиссии(Организация, СчетДоверительногоУправления, Период.ДатаОкончания, Перечисления.ВидыУчета.НалоговыйУчет);	

	ТаблицаНастройки = ОбщиеФункции.ПолучитьТаблицуНастроекИзМакета(МакетНастройка, "ЗаголовкиНУ", "ДанныеНУ", "Колонки", НастройкиУчетаАктивов, НастройкиУчетаКомиссии);	
	
	ВидыУчета = Новый Массив;
	ВидыУчета.Добавить(Перечисления.ВидыУчета.НалоговыйУчет);
		
	Параметры = Новый Структура;
	Параметры.Вставить("ВидыУчета", ВидыУчета);
	Параметры.Вставить("Организация", ЭтотОбъект.Организация);
	Параметры.Вставить("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Параметры.Вставить("ОтчетнаяДата", ЭтотОбъект.Период.ДатаОкончания);
	Параметры.Вставить("НачальнаяДата", ЭтотОбъект.Период.ДатаНачала);
	
	ОбщиеФункции.ПроверкаНастроек(ДокументРезультат, ТаблицаНастройки, Параметры);
		
КонецПроцедуры
